# Используем официальный образ Python
FROM python:3.8-slim

# Устанавливаем переменную окружения для отключения вывода буфера Python
ENV PYTHONUNBUFFERED 1

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем зависимости приложения в контейнер
COPY requirements.txt .

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Копируем все файлы из текущего каталога в контейнер
COPY . .

# Экспонируем порт 5000
EXPOSE 5000

# Команда для запуска приложения при старте контейнера
CMD ["python", "app.py"]
